{
  "_name_or_path": "facebook/mask2former-swin-base-coco-instance",
  "activation_function": "relu",
  "architectures": [
    "Mask2FormerForUniversalSegmentation"
  ],
  "backbone": null,
  "backbone_config": {
    "depths": [
      2,
      2,
      18,
      2
    ],
    "drop_path_rate": 0.3,
    "embed_dim": 128,
    "hidden_size": 1024,
    "model_type": "swin",
    "num_heads": [
      4,
      8,
      16,
      32
    ],
    "out_features": [
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "out_indices": [
      1,
      2,
      3,
      4
    ],
    "path_norm": true,
    "window_size": 12
  },
  "backbone_kwargs": null,
  "class_weight": 2.0,
  "common_stride": 4,
  "decoder_layers": 10,
  "dice_weight": 5.0,
  "dim_feedforward": 2048,
  "dropout": 0.0,
  "encoder_feedforward_dim": 1024,
  "encoder_layers": 6,
  "enforce_input_proj": false,
  "enforce_input_projection": false,
  "feature_size": 256,
  "feature_strides": [
    4,
    8,
    16,
    32
  ],
  "hidden_dim": 256,
  "id2label": {
    "0": "balcony",
    "1": "bath",
    "2": "closet",
    "3": "corridor",
    "4": "entrance",
    "5": "kitchen",
    "6": "living",
    "7": "room",
    "8": "stair",
    "9": "storage",
    "10": "washroom",
    "11": "wc"
  },
  "ignore_value": 255,
  "importance_sample_ratio": 0.75,
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "label2id": {
    "aeroplane": 4,
    "apple": 47,
    "backpack": 24,
    "banana": 46,
    "baseball bat": 34,
    "baseball glove": 35,
    "bear": 21,
    "bed": 59,
    "bench": 13,
    "bicycle": 1,
    "bird": 14,
    "boat": 8,
    "book": 73,
    "bottle": 39,
    "bowl": 45,
    "broccoli": 50,
    "bus": 5,
    "cake": 55,
    "car": 2,
    "carrot": 51,
    "cat": 15,
    "cell phone": 67,
    "chair": 56,
    "clock": 74,
    "cow": 19,
    "cup": 41,
    "diningtable": 60,
    "dog": 16,
    "donut": 54,
    "elephant": 20,
    "fire hydrant": 10,
    "fork": 42,
    "frisbee": 29,
    "giraffe": 23,
    "hair drier": 78,
    "handbag": 26,
    "horse": 17,
    "hot dog": 52,
    "keyboard": 66,
    "kite": 33,
    "knife": 43,
    "laptop": 63,
    "microwave": 68,
    "motorbike": 3,
    "mouse": 64,
    "orange": 49,
    "oven": 69,
    "parking meter": 12,
    "person": 0,
    "pizza": 53,
    "pottedplant": 58,
    "refrigerator": 72,
    "remote": 65,
    "sandwich": 48,
    "scissors": 76,
    "sheep": 18,
    "sink": 71,
    "skateboard": 36,
    "skis": 30,
    "snowboard": 31,
    "sofa": 57,
    "spoon": 44,
    "sports ball": 32,
    "stop sign": 11,
    "suitcase": 28,
    "surfboard": 37,
    "teddy bear": 77,
    "tennis racket": 38,
    "tie": 27,
    "toaster": 70,
    "toilet": 61,
    "toothbrush": 79,
    "traffic light": 9,
    "train": 6,
    "truck": 7,
    "tvmonitor": 62,
    "umbrella": 25,
    "vase": 75,
    "wine glass": 40,
    "zebra": 22
  },
  "mask_feature_size": 256,
  "mask_weight": 5.0,
  "model_type": "mask2former",
  "no_object_weight": 0.1,
  "num_attention_heads": 8,
  "num_hidden_layers": 10,
  "num_queries": 100,
  "output_auxiliary_logits": null,
  "oversample_ratio": 3.0,
  "pre_norm": false,
  "torch_dtype": "float32",
  "train_num_points": 12544,
  "transformers_version": "4.49.0.dev0",
  "use_auxiliary_loss": true,
  "use_pretrained_backbone": false,
  "use_timm_backbone": false
}
